[
  {
    "text": "Actions are judged by intentions, so each man will have what he intended.",
    "book": "Sahih Bukhari",
    "reference": "1",
    "narrator": "Umar bin Al-Khattab"
  },
  {
    "text": "The best among you (Muslims) are those who learn the Quran and teach it.",
    "book": "Sahih Bukhari",
    "reference": "5027",
    "narrator": "Uthman bin Affan"
  },
  {
    "text": "None of you will have faith till he wishes for his (Muslim) brother what he likes for himself.",
    "book": "Sahih Bukhari",
    "reference": "13",
    "narrator": "Anas"
  },
  {
    "text": "He who believes in Allah and the Last Day must either speak good or remain silent.",
    "book": "Sahih Muslim",
    "reference": "47",
    "narrator": "Abu Huraira"
  },
  {
    "text": "A strong believer is better and is more lovable to Allah than a weak believer, and there is good in everyone.",
    "book": "Sahih Muslim",
    "reference": "2664",
    "narrator": "Abu Huraira"
  },
  {
    "text": "Do not wish to be like anyone except in two cases: A person, whom Allah has given wealth and he spends it righteously; and another whom Allah has given wisdom and he acts according to it and teaches it to others.",
    "book": "Sahih Bukhari",
    "reference": "73",
    "narrator": "Abdullah bin Masud"
  },
  {
    "text": "The strong man is not the one who can overpower the tiger, but the one who controls himself when angry.",
    "book": "Sahih Bukhari",
    "reference": "6114",
    "narrator": "Abu Huraira"
  },
  {
    "text": "Cleanliness is half of faith.",
    "book": "Sahih Muslim",
    "reference": "223",
    "narrator": "Abu Malik Al-Ashari"
  },
  {
    "text": "Fear Allah wherever you are, do good deeds after doing bad ones, the former will wipe out the latter, and behave decently towards the people.",
    "book": "Tirmidhi",
    "reference": "1987",
    "narrator": "Abu Dharr"
  },
  {
    "text": "Richness does not lie in the abundance of fancy worldly goods, but true richness is the richness of the self (soul).",
    "book": "Sahih Bukhari",
    "reference": "6446",
    "narrator": "Abu Huraira"
  },
  {
    "text": "The believer does not slander, curse, or speak in an obscene or foul manner.",
    "book": "Tirmidhi",
    "reference": "1977",
    "narrator": "Abdullah bin Masud"
  },
  {
    "text": "When you see a person who has been given more than you in money and beauty, look to those, who have been given less.",
    "book": "Sahih Muslim",
    "reference": "2963",
    "narrator": "Abu Huraira"
  },
  {
    "text": "Exchangegifts, as that will lead to increasing your love to one another.",
    "book": "Al-Adab Al-Mufrad",
    "reference": "594",
    "narrator": "Abu Huraira"
  },
  {
    "text": "Make things easy for people and not difficult. Give people good news and bring them joy, and do not turn them away.",
    "book": "Sahih Bukhari",
    "reference": "69",
    "narrator": "Anas bin Malik"
  },
  {
    "text": "The most perfect man in his faith among the believers is the one whose behaviour is most excellent, and the best of you are those who are the best to their wives.",
    "book": "Tirmidhi",
    "reference": "1162",
    "narrator": "Abu Huraira"
  }
]
